The event arguments used during the data transferring phase of the WorksharedOperationProgressChanged event.
  Namespace:   Autodesk.Revit.DB.Events
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 17.0.0.0 (17.0.1090.0)
  Since:  2017 Subscription Update
 Syntax
  C#
public class DataTransferProgressChangedEventArgs : WorksharedOperationProgressChangedEventArgs
  Visual Basic
Public Class DataTransferProgressChangedEventArgs _
	Inherits WorksharedOperationProgressChangedEventArgs
  Visual C++
public ref class DataTransferProgressChangedEventArgs : public WorksharedOperationProgressChangedEventArgs
 Remarks
 It is NOT recommended to do any time-consuming work when handling WorksharedOperationProgressChanged event. This can increase workshared operation time.
 Inheritance Hierarchy
  System Object
  System EventArgs
  Autodesk.Revit.DB.Events RevitAPIEventArgs
  Autodesk.Revit.DB.Events RevitAPISingleEventArgs
  Autodesk.Revit.DB.Events WorksharedOperationProgressChangedEventArgs
  Autodesk.Revit.DB.Events DataTransferProgressChangedEventArgs
  Autodesk.Revit.DB.Events DocumentReloadLatestProgessChangedEventArgs
  Autodesk.Revit.DB.Events DocumentSaveToCentralProgessChangedEventArgs
 See Also
  DataTransferProgressChangedEventArgs Members
  Autodesk.Revit.DB.Events Namespace